{
  "backend/main.mo": "Motoko canister providing user profile and resume CRUD with role-based access control and auto-promotion of authenticated users to the user role.",
  "feature_evidence.json": "Feature evidence report mapping Android install popup and related functionality to involved files and components with confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries of numerous frontend files describing their functionality for routing, storage, hooks, components, and utilities.",
  "frontend/index.css": "Tailwind base styles defining light/dark theme CSS variables and global styling rules.",
  "frontend/index.html": "Main HTML entry for the PWA including manifest, icons, service worker registration, and font imports.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app metadata, icons, theme colors, scope, and display mode.",
  "frontend/public/sw.js": "Service worker implementing install-time asset caching, cache cleanup, and network‑first fetch handling with offline fallbacks.",
  "frontend/src/App.tsx": "Root React setup configuring TanStack Router routes and theme provider with global toaster.",
  "frontend/src/components/AppFooter.tsx": "Footer displaying attribution, external link, and privacy policy navigation.",
  "frontend/src/components/AppHeader.tsx": "Header with branding, PWA install control, sync badge, and authentication UI.",
  "frontend/src/components/AppLayout.tsx": "Provides the main layout with header, footer, routing outlet, and triggers pending resume sync when online and authenticated.",
  "frontend/src/components/AuthControls.tsx": "Renders login/logout controls using Internet Identity and displays the user's name when authenticated.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Shows a dialog prompting new authenticated users to enter their name and saves the profile.",
  "frontend/src/components/pwa/AndroidInstallPopup.tsx": "Shows an Android‑specific delayed popup prompting PWA installation with dismissal and cooldown logic.",
  "frontend/src/components/pwa/PwaInstallControl.tsx": "Provides an install button for PWA installation or fallback instructions when native prompts are unavailable.",
  "frontend/src/components/pwa/PwaInstallInstructionsDialog.tsx": "Dialog explaining manual PWA installation steps for iOS, Android, and desktop browsers.",
  "frontend/src/components/resume/ResumeFormattingPanel.tsx": "UI panel allowing users to select resume template, font, and color theme, updating formatting state via callbacks.",
  "frontend/src/components/resume/ResumePreview.tsx": "Displays a scaled, scrollable preview of the resume using the template renderer inside a sticky card.",
  "frontend/src/components/resume/ResumePrintView.tsx": "Renders the resume template in a print-only container for printing or PDF export.",
  "frontend/src/components/resume/sections/AchievementsSectionEditor.tsx": "Editor for adding, removing, and editing achievements with fields for title, date, and description.",
  "frontend/src/components/resume/sections/CertificationsSectionEditor.tsx": "Editor managing a list of certifications, allowing creation, deletion, and editing of certification details.",
  "frontend/src/components/resume/sections/EducationSectionEditor.tsx": "Form editor for education entries, supporting institution, degree, dates, current status, and description.",
  "frontend/src/components/resume/sections/ExperienceSectionEditor.tsx": "Editor for work experience entries with fields for company, position, location, dates, and description.",
  "frontend/src/components/resume/sections/HobbiesSectionEditor.tsx": "Simple editor for managing a list of hobbies, allowing adding, removing, and renaming items.",
  "frontend/src/components/resume/sections/LanguagesSectionEditor.tsx": "Provides a UI editor for adding, removing, and editing language entries in a resume, handling state updates for name and proficiency.",
  "frontend/src/components/resume/sections/ProjectsSectionEditor.tsx": "Renders an interface to manage project entries, allowing users to add, remove, and edit details such as name, dates, description, and links.",
  "frontend/src/components/resume/sections/SkillsSectionEditor.tsx": "Implements a skill management editor that supports adding skills, removing them, and modifying names and proficiency levels.",
  "frontend/src/components/resume/templates/ResumeTemplateRenderer.tsx": "Renders a full resume template using provided content and formatting, including sections like summary, experience, education, and skills.",
  "frontend/src/components/ResumeEditorForm.tsx": "Form for editing resume title, personal info, summary, and all resume sections, updating the parent on changes.",
  "frontend/src/components/SyncStatusBadge.tsx": "Displays online/offline status and shows last sync time and pending sync changes for authenticated users.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor instance based on the user’s identity, refetching dependent queries when the actor changes.",
  "frontend/src/hooks/useAndroidInstallPopupCooldown.ts": "Tracks whether an Android install popup was dismissed, persisting a 7‑day cooldown in localStorage with functions to dismiss or clear state.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "Fetches the current user’s profile from the backend actor, managing loading state in coordination with actor initialization.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity authentication, including login, logout, stored identity restoration, and status tracking.",
  "frontend/src/hooks/useOnlineStatus.ts": "Returns the browser’s current online/offline state and updates reactively based on network events.",
  "frontend/src/hooks/usePwaInstall.ts": "Implements a hook that detects PWA install readiness, tracks install state, and exposes a prompt function.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for CRUD operations on backend resumes and user profiles via an actor.",
  "frontend/src/hooks/useResumes.ts": "Combines local and backend resume storage with syncing logic and CRUD mutations using React Query.",
  "frontend/src/index.css": "Defines Tailwind base styles, theming variables, print rules, and resume-specific font and color classes.",
  "frontend/src/main.tsx": "Bootstraps the React app with Internet Identity and React Query providers.",
  "frontend/src/pages/PrivacyPolicy.tsx": "Renders the application's privacy policy using styled card components.",
  "frontend/src/pages/ResumeEditor.tsx": "Resume editor page that loads a resume, manages draft state, supports saving, PDF export, and navigation.",
  "frontend/src/pages/ResumesDashboard.tsx": "React dashboard for listing, creating, renaming, duplicating, and deleting resumes with dialogs and error handling.",
  "frontend/src/storage/resumeLocalStore.ts": "Manages localStorage-based resume CRUD with fallback in-memory storage and version migration.",
  "frontend/src/storage/resumeSyncQueue.ts": "Implements a localStorage-backed sync queue for offline operations with events and timestamp tracking.",
  "frontend/src/types/resume.ts": "Defines TypeScript types and default structures for resumes, sections, content, and formatting.",
  "frontend/src/utils/errorMessage.ts": "Extracts user-friendly error messages and detects storage-related errors.",
  "frontend/src/utils/id.ts": "Generates simple unique IDs for list items.",
  "frontend/src/utils/pdfExport.ts": "Exports a resume to PDF by triggering the browser's print dialog with a sanitized filename.",
  "frontend/src/utils/platform.ts": "Detects Android, iOS, or desktop environments based on user agent and pointer type.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, persisting, and clearing URL and session parameters.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, container queries, animations, and theme extensions.",
  "project_state.json": "Defines the project’s current state, version, and feature list for an ICP-based resume builder application."
}