{
  "backend/main.mo": "Motoko canister implementing access control, user profiles, and CRUD operations for resumes with role promotion for authenticated users.",
  "feature_evidence.json": "Feature evidence report mapping features to affected files, components, and tests with confidence levels.",
  "frontend-file-summaries.txt": "Reference list of summarized descriptions for major frontend files and their functionality.",
  "frontend/index.css": "Global Tailwind-based stylesheet defining color variables, dark mode themes, and base element styling.",
  "frontend/index.html": "Base HTML template loading fonts and mounting the React application root.",
  "frontend/src/App.tsx": "Main React entry configuring routes, theme provider, and global toaster notifications.",
  "frontend/src/components/AppFooter.tsx": "Footer component displaying copyright and a privacy policy link.",
  "frontend/src/components/AppHeader.tsx": "Header with navigation, sync indicator, and authentication controls.",
  "frontend/src/components/AppLayout.tsx": "Root layout handling online sync retries, global toasts, and rendering header, footer, and nested routes.",
  "frontend/src/components/AuthControls.tsx": "Authentication UI for login/logout with Internet Identity and profile display logic.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Displays a dialog prompting authenticated users without a profile to enter and save their name. Handles input state, save action, and visibility logic.",
  "frontend/src/components/resume/ResumeFormattingPanel.tsx": "Lets users choose resume templates, fonts, and color themes, updating formatting settings through callbacks. Renders selectable thumbnail previews and dropdowns.",
  "frontend/src/components/resume/ResumePreview.tsx": "Renders a scaled, scrollable preview of the resume using the template renderer inside a card. Keeps the preview sticky for easy reference while editing.",
  "frontend/src/components/resume/ResumePrintView.tsx": "Provides a print‑only view of the resume by rendering the template at full size for printing. Intended for print media output.",
  "frontend/src/components/resume/sections/AchievementsSectionEditor.tsx": "Allows adding, editing, and removing achievements with fields for title, date, and description. Updates the achievements list through change handlers.",
  "frontend/src/components/resume/sections/CertificationsSectionEditor.tsx": "Manages a list of certifications with editable fields such as name, issuer, dates, and credential ID. Supports adding and deleting certification entries.",
  "frontend/src/components/resume/sections/EducationSectionEditor.tsx": "React component that manages a list of education entries with add, remove, and field editing functionality.",
  "frontend/src/components/resume/sections/ExperienceSectionEditor.tsx": "React UI for adding, removing, and editing work experience items in a resume.",
  "frontend/src/components/resume/sections/HobbiesSectionEditor.tsx": "Component for managing a list of hobbies, allowing users to add, remove, and edit hobby names.",
  "frontend/src/components/resume/sections/LanguagesSectionEditor.tsx": "Editor for language entries, supporting name and proficiency updates with add/remove controls.",
  "frontend/src/components/resume/sections/ProjectsSectionEditor.tsx": "Component for creating and editing project entries including name, description, technologies, link, and dates.",
  "frontend/src/components/resume/sections/SkillsSectionEditor.tsx": "Resume skill editor allowing users to manage skill names and proficiency levels with add/remove actions.",
  "frontend/src/components/resume/templates/ResumeTemplateRenderer.tsx": "Renders a resume using provided content and formatting, with sections for personal info, summary, experience, education, and skills.",
  "frontend/src/components/ResumeEditorForm.tsx": "Provides a multi-section form for editing resume metadata, personal info, summary, and content sections. Propagates changes via callbacks to update the parent resume state.",
  "frontend/src/components/SyncStatusBadge.tsx": "Shows online/offline status and sync information for authenticated users, including last sync time and pending changes. Listens to sync queue updates and displays a tooltip with details.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "Fetches the current user's profile from the backend once an actor is available.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication state, login/logout handling, and initializes stored identities.",
  "frontend/src/hooks/useOnlineStatus.ts": "Tracks and returns the browser's online/offline status.",
  "frontend/src/hooks/useQueries.ts": "Defines mutations and queries for backend resume and user-profile operations using the actor.",
  "frontend/src/hooks/useResumes.ts": "Combines local and backend resumes, handles CRUD operations, and manages offline/online sync behavior.",
  "frontend/src/index.css": "Defines Tailwind base styles, theme variables, resume font/color classes, and print-specific styling.",
  "frontend/src/main.tsx": "Bootstraps the app with React, React Query, and Internet Identity context providers.",
  "frontend/src/pages/PrivacyPolicy.tsx": "Renders the Privacy Policy page with sections describing data storage, permissions, and usage policies.",
  "frontend/src/pages/ResumeEditor.tsx": "Provides the resume editor UI with loading, error handling, editing, saving, and PDF export features.",
  "frontend/src/pages/ResumesDashboard.tsx": "Displays the list of resumes and supports creating, renaming, duplicating, deleting, and navigating to resumes.",
  "frontend/src/storage/resumeLocalStore.ts": "Handles local resume CRUD operations using localStorage with an in-memory fallback and versioning support.",
  "frontend/src/storage/resumeSyncQueue.ts": "Manages a local sync queue for resume operations, including adding, removing, and tracking sync events.",
  "frontend/src/types/resume.ts": "Defines TypeScript types and default values for resume content, formatting, and related sections.",
  "frontend/src/utils/errorMessage.ts": "Provides functions to extract user-friendly error messages and detect storage-related errors.",
  "frontend/src/utils/id.ts": "Generates unique IDs using timestamps and random strings.",
  "frontend/src/utils/pdfExport.ts": "Validates resume data, sets a safe filename, triggers browser print for PDF export, and restores the document title.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, storing, and clearing URL and session parameters, supporting both query and hash routing.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, typography, animations, and container settings with plugins.",
  "project_state.json": "Describes the project's state, versions, and implemented features for an ICP resume builder app."
}