{
  "kind": "build_request",
  "title": "Add Android PWA install popup",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add an in-app install popup that is shown to Android users when the PWA is installable (native beforeinstallprompt is available) and the app is not already installed, offering a direct \"Install\" action that triggers the browser install prompt.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-10"
        ],
        "quotes": [
          "Add Android install popup"
        ]
      },
      "acceptanceCriteria": [
        "On Android (Chrome/Chromium), when `usePwaInstall().canInstall` is true and `isInstalled` is false, a popup is displayed to the user without requiring them to click the existing header install control.",
        "The popup has an \"Install\" button that calls the existing `promptInstall()` flow and, after successful install, the popup is no longer shown.",
        "If the app is already installed (`display-mode: standalone` or equivalent), the popup never shows."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Implement dismissal and frequency controls for the Android install popup so users are not repeatedly interrupted.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-10"
        ],
        "quotes": [
          "Add Android install popup"
        ]
      },
      "acceptanceCriteria": [
        "The popup includes a \"Not now\" (or equivalent) dismiss action.",
        "After dismissing, the popup does not reappear on the next page load for a reasonable cooldown period (persisted in localStorage).",
        "If the user later installs the app, any stored dismissal state no longer causes the popup to appear."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Limit the Android install popup to Android devices/browsers and ensure it does not appear on iOS or desktop.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-10"
        ],
        "quotes": [
          "Add Android install popup"
        ]
      },
      "acceptanceCriteria": [
        "The popup does not render on iOS Safari (or other iOS browsers), even if the app is not installed.",
        "The popup does not render on desktop browsers.",
        "The existing header install control and existing install instructions dialog remain available and functional for all platforms as they are today."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (Shadcn UI sources are read-only).",
    "Do not edit immutable paths listed in SYSTEM_CONTEXT (compose new components/hooks instead)."
  ],
  "nonGoals": [
    "Changing the PWA manifest, service worker caching strategy, or icon assets.",
    "Adding backend support or persisting install-popup state in the canister."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}