{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Android-only PWA in-app install popup with dismissal cooldown",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Show an in-app Android install popup when the PWA is installable and not yet installed, with an Install action that triggers the existing install prompt flow.",
      "acceptanceCriteria": [
        "On Android (Chrome/Chromium), when `usePwaInstall().canInstall` is true and `isInstalled` is false, a popup is displayed to the user without requiring them to click the existing header install control.",
        "The popup has an \"Install\" button that calls the existing `promptInstall()` flow and, after successful install, the popup is no longer shown.",
        "If the app is already installed (`display-mode: standalone` or equivalent), the popup never shows."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/pwa/AndroidInstallPopup.tsx",
          "operation": "create",
          "description": "Create an Android-focused in-app install popup component that uses the existing `usePwaInstall()` hook (canInstall/isInstalled/promptInstall) to auto-open when install is available and to trigger `promptInstall()` from an \"Install\" button; ensure it closes permanently once installation succeeds. Use existing shadcn dialog primitives (e.g., `@/components/ui/dialog`, `@/components/ui/button`) for the popup UI. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/AppLayout.tsx",
          "operation": "modify",
          "description": "Wire `AndroidInstallPopup` into the global app layout so it can appear automatically on relevant pages without user interaction, while keeping the existing header install control unchanged."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Add dismissal and cooldown controls for the Android install popup, persisted in localStorage and cleared on install.",
      "acceptanceCriteria": [
        "The popup includes a \"Not now\" (or equivalent) dismiss action.",
        "After dismissing, the popup does not reappear on the next page load for a reasonable cooldown period (persisted in localStorage).",
        "If the user later installs the app, any stored dismissal state no longer causes the popup to appear."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useAndroidInstallPopupCooldown.ts",
          "operation": "create",
          "description": "Create a small hook/utility to manage install-popup dismissal state in localStorage (e.g., store last-dismissed time and compute whether cooldown has expired), and provide helpers to dismiss and to clear state when the app becomes installed."
        },
        {
          "path": "frontend/src/components/pwa/AndroidInstallPopup.tsx",
          "operation": "modify",
          "description": "Add a \"Not now\" action that records dismissal via the cooldown hook, prevents reopening until the cooldown expires, and clears any stored dismissal state when installation succeeds (based on `promptInstall()` result and/or `isInstalled` becoming true). Use existing shadcn Button styling for actions. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Restrict the install popup to Android devices/browsers only, preventing rendering on iOS and desktop while leaving existing install controls intact.",
      "acceptanceCriteria": [
        "The popup does not render on iOS Safari (or other iOS browsers), even if the app is not installed.",
        "The popup does not render on desktop browsers.",
        "The existing header install control and existing install instructions dialog remain available and functional for all platforms as they are today."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/platform.ts",
          "operation": "create",
          "description": "Add lightweight platform detection helpers to identify Android vs iOS vs desktop (e.g., UA checks plus a coarse-pointer/mobile heuristic) for gating the Android install popup without affecting other install UI."
        },
        {
          "path": "frontend/src/components/pwa/AndroidInstallPopup.tsx",
          "operation": "modify",
          "description": "Gate popup rendering to Android only using the new platform helper(s), and ensure it returns null on iOS and on desktop-class browsers even if installability conditions are met; do not alter `PwaInstallControl` or `PwaInstallInstructionsDialog` behavior. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}